Repository: KeidsID/dicoding_restaurant_app
Catalog: lib/l10n/app_*.arb
Languages: id

# loginBtn
source: LOG IN
id: MASUK

# setUsernamePageHeading
source: How do we call you?
id: Bagaimana kami memanggil anda?

# confirmBtn
source: CONFIRM
id: KONFIRMASI

# toSignUpPageBtn
source: DON'T HAVE AN ACCOUNT YET? REGISTER HERE
id: BELUM PUNYA AKUN? DAFTAR DISINI

source: Name
id: Nama

# nameTxtFieldHint
source: Pseudonym allowed
id: Nama samaran diperbolehkan

source: Password
id: Kata Sandi

# signUpBtn
source: SIGN UP
id: DAFTAR

# anonymousLoginBtn
source: LOG IN AS ANONYMOUS
id: MASUK SEBAGAI ANONIM

source: Email not available
id: Email tidak tersedia

source: Sign Out
id: Keluar Akun

source: Daily reminder
id: Pengingat harian

source: Notifications test
id: Tes notifikasi

source: Available
id: Tersedia

source: In progress
id: Sedang berlangsung

# searchTxtFieldHint
source: Search restaurant name
id: Cari nama restoran

source: App Info
id: Info Aplikasi

# searchResultFounded
source: {count, plural, =0{No restaurants found} =1{A restaurant found} other{{count} restaurants found}
id: {count, plural, =0{Tidak ada restoran yang ditemukan} =1{Restoran ditemukan} other{{count} restoran ditemukan}

# aboutApp
source: This app is a project assignment from dicoding.com intermediate Flutter class. It is hoped that with this assignment, students can create Flutter applications by implementing common features such as data retrieval from the internet, local storage, notifications, and testing.
id: Aplikasi ini adalah tugas proyek dari kelas Flutter menengah dicoding.com. Diharapkan dengan adanya tugas ini, siswa dapat membuat aplikasi Flutter dengan mengimplementasikan fitur-fitur umum seperti pengambilan data dari internet, penyimpanan lokal, notifikasi, dan testing.

source: Version
id: Versi

source: App GitHub Repo
id: Repo GitHub Aplikasi

# goBackBtn
source: GO BACK
id: KEMBALI

# foodsTab
source: FOODS
id: MAKANAN

# drinksTab
source: DRINKS
id: MINUMAN

# reviewHeading
source: {count, plural, =1{Review} other{Reviews}}
id: {count, plural, other{Ulasan}}

# reviewsCheck
source: Check more reviews
id: Cek lebih banyak ulasan

# leaveAReview
source: Review this restaurant
id: Tinjau restoran ini

# reviewCantEmpty
source: Review can't be empty
id: Ulasan tidak boleh kosong

source: Discard draft?
id: Buang draf?

# cancelBtn
source: CANCEL
id: BATAL

# discardBtn
source: DISCARD
id: BUANG

# postReviewInfo
source: Review are public and include your name.
id: Ulasan bersifat publik dan mencantumkan nama Anda.

# reviewTxtFieldHint
source: Describe your experience
id: Deskripsikan pengalamanmu

source: No internet access
id: Tidak ada akses internet

# noApiData
source: No restaurant data received
id: Tidak ada data restoran yang diterima

# noDbData
source: No wishlist. Try add to some.
id: Tidak ada wishlist. Coba tambahkan beberapa.

# anonymousLoginDisabled
source: Anonymous log in is not available
id: Masuk anonim tidak tersedia

# invalidEmail
source: Invalid email address
id: Alamat email salah

# userDisabled
source: Account disabled by admin
id: Akun dinonaktifkan oleh admin

# userNotFound
source: Account not found, try to create a new account
id: Akun tidak ditemukan, coba buat akun baru

source: Wrong password
id: Kata sandi salah

# emailAlreadyInUse
source: This email was already used to create a user
id: Email ini sudah digunakan untuk membuat pengguna

# operationNotAllowed
source: Currently the app is not accepting new users
id: Saat ini applikasi tidak menerima pengguna baru

# weakPassword
source: The password you are using is weak. Try to use at least 1 number, uppercase, lowercase, and symbols.
id: Kata sandi yang Anda gunakan lemah. Cobalah untuk menggunakan setidaknya 1 angka, huruf besar, huruf kecil, dan simbol.
